# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Step 4. Discover what is the mean age per occupation

In [3]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [4]:
users['gender'] = users['gender'].map({'M': 1, 'F': 0})
users.head()

   user_id  age  gender  occupation zip_code
0        1   24       1  technician    85711
1        2   53       0       other    94043
2        3   23       1      writer    32067
3        4   24       1  technician    43537
4        5   33       0       other    15213

In [5]:
users.groupby('occupation')['gender'].sum().head()

occupation
administrator    43
artist           15
doctor            7
educator         69
engineer         65
Name: gender, dtype: int64

In [6]:
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

In [7]:
male_proportion = users.groupby('occupation')['gender'].sum() / users.occupation.value_counts() * 100
male_proportion.rename('male_proportion')\
               .reset_index()\
               .sort_values('male_proportion', ascending=False)\
               .head()

         index  male_proportion
2       doctor       100.000000
4     engineer        97.014925
19  technician        96.296296
15     retired        92.857143
14  programmer        90.909091

### Step 6. For each occupation, calculate the minimum and maximum ages

In [8]:
users.groupby('occupation').agg({'age':['min', 'max']})\
                           .head()

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [9]:
users.groupby(['occupation', 'gender']).age\
                                       .mean()\
                                       .round(2)\
                                       .rename('age_mean')\
                                       .reset_index()\
                                       .head(10)

      occupation  gender  age_mean
0  administrator       0     40.64
1  administrator       1     37.16
2         artist       0     30.31
3         artist       1     32.33
4         doctor       1     43.57
5       educator       0     39.12
6       educator       1     43.10
7       engineer       0     29.50
8       engineer       1     36.60
9  entertainment       0     31.00

### Step 8.  For each occupation present the percentage of women and men

In [13]:
users.groupby('occupation')['gender'].value_counts(normalize=True).mul(100).round(1)

occupation     gender
administrator  1          54.4
               0          45.6
artist         1          53.6
               0          46.4
doctor         1         100.0
educator       1          72.6
               0          27.4
engineer       1          97.0
               0           3.0
entertainment  1          88.9
               0          11.1
executive      1          90.6
               0           9.4
healthcare     0          68.8
               1          31.2
homemaker      0          85.7
               1          14.3
lawyer         1          83.3
               0          16.7
librarian      0          56.9
               1          43.1
marketing      1          61.5
               0          38.5
none           1          55.6
               0          44.4
other          1          65.7
               0          34.3
programmer     1          90.9
               0           9.1
retired        1          92.9
               0           7.1
salesman       1          75.0
               0          25.0
scientist      1          90.3
               0           9.7
student        1          69.4
               0          30.6
technician     1          96.3
               0           3.7
writer         1          57.8
               0          42.2
Name: gender, dtype: float64